<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
	"http://www.w3.org/TR/html4/strict.dtd">

<html>
<head>

<meta name="author" content="Erik Barz">

		<link rel="stylesheet" type="text/css" href="css/styles.css">

<title>Schulhomepage - Prüfung Informatik 10. Klasse</title>

</head>

<body class="iframe">

<p><div class="heading">Chronik</div></p>

<p>
Am 18.04.1341 erhalten wir das erste schriftliche Zeugnis vom "Lyzeum Frankfortense schola sentoria". Das &auml;rmliche Schulhaus lehnte sich an die s&uuml;dliche Friedhofsmauer der Marienkirche. Wegen ihrer Lage in der Oberstadt wird der Name " Oberschule" f&uuml;r diese Ratsschule &uuml;blich. Unterrrichtsf&auml;cher waren "Latein", "Religion" und "Gesang".
</p>

<p>
1539 erh&auml;lt die Oberschule den Status einer st&auml;dtischen Gelehrtenschule.
</p>

<p>
1739 wurde gegen&uuml;ber dem alten Geb&auml;ude ein dreigeschossiger Neubau f&uuml;r den Schulunterricht &uuml;bergeben, ein zur damaligen Zeit sehr beachtlicher Schulneubau. Die Oberschule vermittelte nun auch Kenntnisse in "Rechnen", "Logik", "Schreiben", "Geschichte" und "Geographie". Um die Jahrhundertwende zeigte sich eine Hinwendung zu den realen Wissenschaften.
</p>

<p>
1814 wurde das repr&auml;sentative Schulgeb&auml;ude der Sitz der neuen Provinzialregierung. F&uuml;r die Schule fand sich nur eine Übergangsl&ouml;sung, das alte Bischofshaus auf dem Manegehof. Zeitweilig besuchten die Oberschule nur noch 38 Sch&uuml;ler.
</p>

<p>
1824zieht die Oberschule in das ehemalige Geb&auml;ude der Universit&auml;t.
</p>

<p>
Erst 1829 konnte durch Rektor Dr.Ewald ein neuer Aufschwung erreicht werden. In der Stundentafel ist eine Durchsetzung der realen Wissenschaften, besonders in der Schwerpunktverlagerung Mathematik und Naturwissenschaften erkennbar.
</p>

<p>
1832 wird Karl Wilhelm Wiecke Rektor. Er wollte eine Schule f&uuml;r die Anforderungen der Zeit schaffen, in der allen Kindern, unabh&auml;ngig von Konfession und sozialem Stand, die M&ouml;glichkeit zur besseren Bildung gegeben wurde.
Bei Vorrang der Muttersprache wird nun Latein, Franz&ouml;sich und Englisch gelehrt und die klare Dominanz des mathematisch-naturwissenschaftlichen Bereiches erreicht.
</p>

<p>
Am 25. April 1911 wurde das Realgymnasium in der heutigen Wieckestra&szlig;e eingeweiht. Ein "m&auml;chtiger Bau schlo&szlig;artig weit &uuml;ber den H&auml;usern der Stadt" war f&uuml;r 800.000 Goldmark errichtet worden. Drei Jahre sp&auml;ter zogen viele der Primaner freiwillig in den Krieg, aus dem 194 ehemlaige Sch&uuml;ler nicht zur&uuml;ckkehrten. F&uuml;r diese Zeit nach dem Ersten Weltkrieg ist besonders der Ausbau au&szlig;erschulischer Aktivit&auml;ten typisch.
In der NS-Zeit traten als neue F&auml;cher und Inhalte "Rassenkunde" und "Vererbungslehre" auf.
</p>

<p>
Im Oktober 1945 konnte zun&auml;chst der Grundschulunterricht wieder in diesem Geb&auml;ude aufgenommen werden. Der Unterricht der Oberschule erfolgte ab April 1946.
Die 400 Sch&uuml;ler kamen aus allen ehemaligen h&ouml;heren Schulen Frankfurts und es gab gesonderte Abiturklassen f&uuml;r zur&uuml;ckgekehrte "Soldaten Flakhelfer" und "Volkssturmm&auml;nner".
Neu waren die F&auml;cher "Gegenwartskunde" und "Russisch".
Schon nach einem Jahr mu&szlig;te das Gymnasium f&uuml;r eine Grundschule ger&auml;umt werden.
</p>

<p>
1947 hatte die Oberschule in der ehemalige Friedrichsschule ihr Domizil, nachdem aus diesem Geb&auml;ude ein Hilfslazarett ausgezogen war. Es wurde eine Teilung der Oberschule in einen sprachlichen und einen naturwissenschaftlichen Zweig vorgenommen, aus der schlie&szlig;lich zwei gesonderte Schulen entstanden. W&auml;hrend der sprachlich ausgerichtete im Friedrichsgymnasium verblieb, zog der naturwissenschaftliche Zweig zur&uuml;ck in das Geb&auml;ude in die Wieckestra&szlig;e.
Lehrermangel zwang sp&auml;ter zur Vereinigung der beiden Schulen.
</p>

<p>
Fast 30 Jahre konnte die Erweiterte Oberschule "Karl Liebknecht" ihre Lehrt&auml;tigkeit in der Wieckestra&szlig;e aus&uuml;ben. Auf dem Stundenplan erschienen die F&auml;cher "Staatsb&uuml;rgerkunde" und "Polnisch".
Die Ausbildung sah zeitweise vor, den Sch&uuml;lern gleichzeitig mit dem Abitur eine Berufsausbildung zu vermitteln.
</p>

<p>
1978 sollte eine geplante P&auml;dagogische Hochschule in Frankfurt das repr&auml;sentative Schuleb&auml;ude &uuml;bernehmen und die Erweiterte Oberschule wurde in einem neuen Schulgeb&auml;ude in Neuberesinchen untergebracht.
Im Rahmen des UNESCO-Projects leistet die Schule intensive Arbeit und hatte unter anderem enge Beziehungen zu einem Lyzeum in Gorzow. Ein neues Fach war "Sozialistische Wehrerziehung".
</p>

<p>
1989 erfolgte der Umzug in das alte Geb&auml;ude der fr&uuml;heren St&auml;dtischen Mittelschule am Lenne Park.
</p>

<p>
1990, nach der Wende, konnte das Stammgeb&auml;ude in der Wieckestra&szlig;e wieder bezogen werden.
Das "St&auml;dtische Gymnasium I" wird ab der 7. Klasse von fast 800 Sch&uuml;lern besucht.
Die materielle Ausgestaltung, besonders auf dem naturwissenschaftlichen Gebiet und die M&ouml;glichkeit von Sprachreisen erm&ouml;glichen neue Bereiche p&auml;dagogischer Arbeit.
Polnische Sch&uuml;ler besuchen das Frankfurter Gymnasium und legen hier auch das Deutsche Abitur ab. Ab dem Schuljahr (1997/98) werden jedes Jahr 26 polnische Sch&uuml;lerInnen in jeweils 2 deutsch-polnische Klassen aufgenommen.
Im Lehrplan treten neue F&auml;cher "Politische Bildung", "Psychologie", "Informatik" und "Technik" auf. Der Ausbildung in Englisch und Franz&ouml;sisch wird ein gr&ouml;&szlig;eres Gewicht verliehen.
</p>

<p>
1992 Mit einem Besuch der Ministerin f&uuml;r Bildung, Jugend und Sport des Landes Brandenburg, Frau Marianne Birthler, an unserer Bildungseinrichtung wird das erste deutsch-polnische Schulprojekt im August 1992 er&ouml;ffnet.
Die ersten polnischen Sch&uuml;lerinnen und Sch&uuml;ler besuchen das Frankfurter Gymnasium und legen hier im Juni 1995 erfolgreich das deutsche Abitur ab.
</p>

<p>
1996 Das Karl-Liebknecht-Gymnasium Frankfurt (Oder) beteiligt sich mit einem Projekttag und vielen Veranstaltungen am internationalen Gedenktag der UNESCO f&uuml;r die Folgen des Ungl&uuml;cks von Tschernobyl.
</p>

<p>
1998 Mit einem gemeinsamen Fr&uuml;hst&uuml;ck feiern die Sch&uuml;lerinnen und Sch&uuml;ler des Gymnasiums mit ihren Lehrerinnen und Lehrern das 25-j&auml;hrige UNESCO-Jubil&auml;um am letzten Schultag vor den Weihnachtsferien.
</p>

<p>
1999 das Karl-Liebknecht-Gymnasium Frankfurt (Oder) widmet sich in seiner p&auml;dagogischen Arbeit in besonderer Weise seit vielen Jahren dem europ&auml;ischen Gedanken. Als UNESCO-Projektschule geh&ouml;ren neben intensiven Kontakten zu unseren polnischen Nachbarn auch lebendige Schulpartnerschaften zu Bildungseinrichtungen in mehreren europ&auml;ischen L&auml;ndern.
In W&uuml;rdigung dieser Arbeit wird unserer Schule durch das Ministerium f&uuml;r Bildung, Jugend und Sport der Name "Europaschule" verliehen.
Die feierliche Ehrung fand am Montag, dem 7. Juni 1999, um 14 Uhr im Rahmen eines Europafestes in der Aula statt.
</p>

<p>
2000 Das internationale "Camp 2000" vereint vom 18. Bis 23. September die Teilnehmer des COMENIUS-Projektes aus Trollh&auml;ttan, Wissembourg und Nottingham und unserer Schule zum H&ouml;hepunkt und Abschluss der gemeinsamen Arbeit am Thema "Youth culture" am Helenesee bei Frankfurt (Oder). In gemeinsamen Pr&auml;sentationen und Workshops werden die Ergebnisse unserer multinationalen Zusammenarbeit vorgestellt. Gleichzeitig verabredet man die weitere partnerschaftliche Zusammenarbeit.
</p>

<p>
2000 Israelischer Besuch am Karl-Liebknecht-Gymnasium. Herr Rafig Elmalek und Herr Husni Hjyahya, Schulleiter zweier arabischer Schulen in Israel informieren sich am 19. Oktober &uuml;ber unsere Schule, die Bildungsangebote und das p&auml;dagogische Profil. Beide Seiten erkl&auml;ren ihre Bereitschaft zum Aufbau einer Schulpartnerschaft.
</p>

<p>
2001 Feierstunde 90 Jahre Schule in unserem Geb&auml;ude. 
</p>

<p>
Bearbeitungsstand Mai 2001
</p>

<br><br><br>

</body>
</html>